situation = ['먹방','미식','절약','주말','아이','소확행','sunday',
             '혼밥','저렴이','먹잘알','점심','이번주','혼밥왕','먹부림',
             '야외','퇴근','즐거운주말','주말그램','푸드파이터','고달픈하루','아점먹기',
             '오늘은분식이닷','아점먹기','건강','때웠다','다이어트식단',
             '다이어트','직장인다이어트','다이어트일지','채식','집밥같은김밥','살찐다',
             '남편과','나들이','소풍','야식스타그램','야식은','탄수화묿중독','건강한맛',
             '바쁜하루','산책','야구','불금','열일','그만먹어야지',
             '살안쪄요','살찌는소리','혼밥맛집','숙취','유지어터그램','일반식유지어터',
             '운동','급찐급빠','자기관리','식단','데이트','아침은간단히','팀프로젝트','회사에서',
             '피크닉','임신초기','나홀로','휴가','스트레스해소','간식','디저트','오빠랑','야식추천',
             '다이어트망함','맛있으면0칼로리','저탄고지','데이트그램','데이뚜','신혼일기','여보랑',
             '볼링','하원후간식','아들이랑','아들','딸','남자친구','토요일밤','아침','회사간식','혼술',
             '커플그램','겨울간식','휴무','월요일','화요일','수요일','목요일','금요일','토요알','일요일','주말간식',
             '시험','벼락치기','시험공부','시험기간','과제','공부','동생이랑','언니랑','야근싫어','야근이네'
             '저녁','간식스타그램','빵순이','커플','끼니해결','프로혼밥러','혼술러','신혼부부','부부스타그램','저녁식사',
             '신제품','집순이','방콕','술안주','술','짜증폭팔','힘내자','심심','불목','생맥주','육아','멕주','늦은점심','쇼핑','힘들다',
             '한강','브런치','독서','추억','황금연휴','개피곤','엄마랑','스트레스','스트레스해소','불토','지친다','극복','특식','치팅데이',
             '친구','친구들','자취음식']


mat = ['바른재료','깔끔','담백함','단짠단짠','달달구리','밍밍','부상맛','중상맛','매워','혼수상태맛','사망맛','맵다']

job = ['환자','직딩','직장인스타그램','맘스타그램','육아맘','주부스타그램','육아소통','육아스타그','공시생그램','공시생일기','공스타그램',
       '중학생','중딩스타그램','대학생','워킹맘','새댁','자취생']

